PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_syspm_v4.c
#if (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        SCS_CPPWR |= SCS_CPPWR_SU10_Msk;
#endif
#if (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        MEM_CTL_MSCR &= ~(MEMSYSCTL_MSCR_ICACTIVE_Msk);
        MEM_CTL_MSCR &= ~(MEMSYSCTL_MSCR_DCACTIVE_Msk);
        EWIC_EWCI_ASCR &= ~(EWIC_EWIC_ASCR_ASPU_Msk);
#endif

        retVal = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        retVal = CY_SYSPM_BAD_PARAM;
        break;
    }
    return retVal;
}

cy_en_syspm_deep_sleep_mode_t Cy_SysPm_GetSysDeepSleepMode(void)
{
    uint32_t mode;
    cy_en_syspm_deep_sleep_mode_t deepSleepMode;

    mode = (uint32_t)cy_pd_ppu_get_programmed_power_mode((struct ppu_v1_reg *)CY_PPU_MAIN_BASE);

    switch (mode)
    {
    case (uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_MODE:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP;
    }
    break;

    case (uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_RAM_MODE:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP_RAM;
    }
    break;

    case (uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_OFF_MODE:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP_OFF;
    }
    break;

    default:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP_NONE;
    }
    break;
    }

    return deepSleepMode;
}

cy_en_syspm_status_t Cy_SysPm_SetAppDeepSleepMode(cy_en_syspm_deep_sleep_mode_t deepSleepMode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    switch (deepSleepMode)
    {
    case CY_SYSPM_MODE_DEEPSLEEP:
    {
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_PD1_BASE, (uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_MODE); /* Suppress a compiler warning about unused return value */
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_APPCPU_BASE, (uint32_t)CY_SYSTEM_APPCPU_PPU_DEEPSLEEP_MODE); /* Suppress a compiler warning about unused return value */
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_APPCPUSS_BASE, (uint32_t)CY_SYSTEM_APPCPUSS_PPU_DEEPSLEEP_MODE); /* Suppress a compiler warning about unused return value */

#if (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        SCS_CPPWR &= ~(SCS_CPPWR_SU10_Msk);
#endif
        retVal = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_MODE_DEEPSLEEP_RAM:
    {
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_PD1_BASE, (uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_RAM_MODE); /* Suppress a compiler warning about unused return value */
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_APPCPU_BASE, (uint32_t)CY_SYSTEM_APPCPU_PPU_DEEPSLEEP_RAM_MODE); /* Suppress a compiler warning about unused return value */
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_APPCPUSS_BASE, (uint32_t)CY_SYSTEM_APPCPUSS_PPU_DEEPSLEEP_RAM_MODE); /* Suppress a compiler warning about unused return value */

#if (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        SCS_CPPWR |= SCS_CPPWR_SU10_Msk;
#endif


#if (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        MEM_CTL_MSCR &= ~(MEMSYSCTL_MSCR_ICACTIVE_Msk);
        MEM_CTL_MSCR &= ~(MEMSYSCTL_MSCR_DCACTIVE_Msk);
        EWIC_EWCI_ASCR &= ~(EWIC_EWIC_ASCR_ASPU_Msk);
#endif

        retVal = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_MODE_DEEPSLEEP_OFF:
    {
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_PD1_BASE, (uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_OFF_MODE); /* Suppress a compiler warning about unused return value */
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_APPCPU_BASE, (uint32_t)CY_SYSTEM_APPCPU_PPU_DEEPSLEEP_OFF_MODE); /* Suppress a compiler warning about unused return value */
        (void)cy_pd_ppu_set_power_mode((struct ppu_v1_reg *)CY_PPU_APPCPUSS_BASE, (uint32_t)CY_SYSTEM_APPCPUSS_PPU_DEEPSLEEP_OFF_MODE); /* Suppress a compiler warning about unused return value */

#if (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        SCS_CPPWR |= SCS_CPPWR_SU10_Msk;
#endif
#if (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
        MEM_CTL_MSCR &= ~(MEMSYSCTL_MSCR_ICACTIVE_Msk);
        MEM_CTL_MSCR &= ~(MEMSYSCTL_MSCR_DCACTIVE_Msk);
        EWIC_EWCI_ASCR &= ~(EWIC_EWIC_ASCR_ASPU_Msk);
#endif

        retVal = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        retVal = CY_SYSPM_BAD_PARAM;
        break;
    }
    return retVal;
}

cy_en_syspm_deep_sleep_mode_t Cy_SysPm_GetAppDeepSleepMode(void)
{
    uint32_t mode;
    cy_en_syspm_deep_sleep_mode_t deepSleepMode;

    mode = (uint32_t)cy_pd_ppu_get_programmed_power_mode((struct ppu_v1_reg *)CY_PPU_PD1_BASE);

    switch (mode)
    {
    case (uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_MODE:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP;
    }
    break;

    case (uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_RAM_MODE:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP_RAM;
    }
    break;

    case (uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_OFF_MODE:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP_OFF;
    }
    break;

    default:
    {
        deepSleepMode = CY_SYSPM_MODE_DEEPSLEEP_NONE;
    }
    break;
    }

    return deepSleepMode;
}


cy_en_syspm_status_t Cy_SysPm_SetDeepSleepMode(cy_en_syspm_deep_sleep_mode_t deepSleepMode)
{

#if  (!defined(CY_USE_RPC_CALL) || (CY_USE_RPC_CALL == 0))|| defined (COMPONENT_SECURE_DEVICE)
#if (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33)
    return Cy_SysPm_SetSysDeepSleepMode(deepSleepMode);
#elif (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)
    return Cy_SysPm_SetAppDeepSleepMode(deepSleepMode);
#else
    return Cy_SysPm_SetSysDeepSleepMode(deepSleepMode);
#endif
#else
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    rpcInputArgs.argc = 4;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_PM;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_PM_SET_DS_MODE;
    rpcInputArgs.argv[2] = (uint32_t)__CORTEX_M;/* coreID */
    rpcInputArgs.argv[3] = (uint32_t)deepSleepMode;
    cy_rpc_invec_t in_vec[] =
    {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
    };

