PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_syspm_v4.c
    /* Unlock PWR MACRO Control */
    /* Clear bit 0(CLR0)*/
    MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum) = MXSRAMC_PWR_MACRO_CTL_LOCK_CLR0;
    /* Clear bit 1(CLR1)*/
    MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum) = MXSRAMC_PWR_MACRO_CTL_LOCK_CLR1;

    if (sramPwrMode == CY_SYSPM_SRAM_PWR_MODE_ON)
    {
        /* Enable the Macro Number */
        MXSRAMC_PWR_MACRO_CTL(sramNum) &= ~(0x1UL << (uint32_t)sramMacroNum);
    }
    else
    {
        /* Disable the Macro Number */
        MXSRAMC_PWR_MACRO_CTL(sramNum) |= (0x1UL << (uint32_t)sramMacroNum);
    }
    /* Wait for the PWR_DONE status */
    while (!_FLD2BOOL(RAMC_STATUS_PWR_DONE, MXSRAMC_STATUS(sramNum))) {}

    /* Lock PWR MACRO Control(Set SET01) */
    MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum) = MXSRAMC_PWR_MACRO_CTL_LOCK_SET01;

    return CY_SYSPM_SUCCESS;
}

cy_en_syspm_status_t Cy_SysPm_SetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    return Cy_SysPm_SetSRAMMacroPwrModeInline(sramNum, sramMacroNum, sramPwrMode);
}

cy_en_syspm_sram_pwr_mode_t Cy_SysPm_GetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum)
{
    cy_en_syspm_sram_pwr_mode_t value;

    CY_ASSERT_L3((sramNum == CY_SYSPM_SRAM0_MEMORY) || (sramNum == CY_SYSPM_SRAM1_MEMORY));
    CY_ASSERT_L3(sramMacroNum < CY_CPUSS_RAMC_MACRO_NR(sramNum));

    /* Unlock PWR MACRO Control */
    /* Clear bit 0(CLR0)*/
    MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum) = MXSRAMC_PWR_MACRO_CTL_LOCK_CLR0;
    /* Clear bit 1(CLR1)*/
    MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum) = MXSRAMC_PWR_MACRO_CTL_LOCK_CLR1;

    value = (((MXSRAMC_PWR_MACRO_CTL(sramNum) & (0x1UL << (uint32_t)sramMacroNum)) != 0UL) ? CY_SYSPM_SRAM_PWR_MODE_OFF : CY_SYSPM_SRAM_PWR_MODE_ON);

    /* Lock PWR MACRO Control(Set SET01) */
    MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum) = MXSRAMC_PWR_MACRO_CTL_LOCK_SET01;

    return value;

}


cy_en_syspm_status_t Cy_SysPm_SetSRAMPwrMode(cy_en_syspm_sram_index_t sramNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    uint8_t macroNum;
    CY_ASSERT_L3((sramNum == CY_SYSPM_SRAM0_MEMORY) || (sramNum == CY_SYSPM_SRAM1_MEMORY));
    CY_ASSERT_L3((sramPwrMode == CY_SYSPM_SRAM_PWR_MODE_ON) || (sramPwrMode == CY_SYSPM_SRAM_PWR_MODE_OFF));

    for (macroNum = 0; (macroNum < CY_CPUSS_RAMC_MACRO_NR(sramNum)); macroNum++)
    {
        (void)Cy_SysPm_SetSRAMMacroPwrMode(sramNum, (uint32_t)macroNum, sramPwrMode);
    }

    return CY_SYSPM_SUCCESS;
}

void Cy_SysPm_TriggerSoftReset(void)
{
    SRSS_RES_SOFT_CTL = SRSS_RES_SOFT_CTL_TRIGGER_SOFT_Msk;
}

void Cy_SysPm_TriggerXRes(void)
{
    SRSS_RES_PXRES_CTL = SRSS_RES_PXRES_CTL_PXRES_TRIGGER_Msk;
}

bool Cy_SysPm_IsSystemLp(void)
{
    return (CY_SYSPM_CORE_BUCK_PROFILE_LP == Cy_SysPm_CoreBuckGetProfile());
}

bool Cy_SysPm_IsSystemUlp(void)
{
    return (CY_SYSPM_CORE_BUCK_PROFILE_ULP == Cy_SysPm_CoreBuckGetProfile());
}

bool Cy_SysPm_IsSystemHp(void)
{
    return (CY_SYSPM_CORE_BUCK_PROFILE_HP == Cy_SysPm_CoreBuckGetProfile());
}

static void Cy_SysPm_SetTrimRamCtl(uint8_t index, uint32_t trimValue)
{
    SRSS_TRIM_RAM_CTL(index) = trimValue;
}

static void Cy_SysPm_SystemEnterHpToDs(void)
{
    uint32_t clkHfMask = Cy_SysClk_ClkHfAllGetMask();
    /* HP to DS Sequence */
    /* HP->DS(1) */
    /* Change HP frequency to 50MHz */
    Cy_SysClk_ClkHfEnableDirectMuxWithMask(clkHfMask, true);

    /* HP->DS(2) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_60B);

    /* HP->DS(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_E1F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_61F);

    /* HP->DS(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_1E3F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_E3F);

    /* HP->DS(5) */
    /* Change frequency to 4MHz */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_DIVIDE_BY_12); */
}

static void Cy_SysPm_SystemEnterDsToHp(void)
{
    uint32_t clkHfMask = Cy_SysClk_ClkHfAllGetMask();
    /* DS to HP Sequence */
    /* DS->HP(2) */
    /* Change frequency to 50MHz */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_NO_DIVIDE); */

    /* DS->HP(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_E1F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_61F);

    /* DS->HP(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_60B);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_20B);

    /* DS->HP(5) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_202);

    /* DS->HP(6) */
    /* Change frequency to HP Frequency */
    Cy_SysClk_ClkHfEnableDirectMuxWithMask(clkHfMask, false);
}

static void Cy_SysPm_SystemEnterLpToDs(void)
{
    uint32_t clkHfMask = Cy_SysClk_ClkHfAllGetMask();
    /* LP to DS Sequence */
    /* LP->DS(1) */
    /* Change LP frequency to 50MHz */
    Cy_SysClk_ClkHfEnableDirectMuxWithMask(clkHfMask, true);

    /* LP->DS(2) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_60D);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_60D);

    /* LP->DS(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_E1F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_61F);

    /* LP->DS(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_1E3F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_E3F);

    /* LP->DS(5) */
    /* Change frequency to 4MHz */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_DIVIDE_BY_12); */
}

static void Cy_SysPm_SystemEnterDsToLp(void)
{
    uint32_t clkHfMask = Cy_SysClk_ClkHfAllGetMask();
    /* DS to LP Sequence */
    /* DS->LP(2) */
    /* Change frequency to 50MHz */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_NO_DIVIDE); */

    /* DS->LP(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_E1F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_61F);

    /* DS->LP(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_60D);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_60D);

    /* DS->LP(5) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_604);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_604);

    /* DS->LP(6) */
    /* Change frequency to LP Frequency */
    Cy_SysClk_ClkHfEnableDirectMuxWithMask(clkHfMask, false);
}


static void Cy_SysPm_SystemEnterUlpToDs(void)
{
    uint32_t clkHfMask = Cy_SysClk_ClkHfAllGetMask();

