PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_syspm_v4.c
    /* ULP to DS Sequence */
    /* ULP->DS(1) */
    /* Change ULP frequency to 25MHz */
    Cy_SysClk_ClkHfEnableDirectMuxWithMask(clkHfMask, true);
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_DIVIDE_BY_2); */

    /* ULP->DS(2) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_60F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_60F);

    /* ULP->DS(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_E1F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_61F);

    /* ULP->DS(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_1E3F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_E3F);

    /* ULP->DS(5) */
    /* Change frequency to 4MHz */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_DIVIDE_BY_12); */
}

static void Cy_SysPm_SystemEnterDsToUlp(void)
{
    uint32_t clkHfMask = Cy_SysClk_ClkHfAllGetMask();
    /* DS to ULP Sequence */
    /* DS->ULP(2) */
    /* Change frequency to 25MHz */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_DIVIDE_BY_2); */

    /* DS->ULP(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_E1F);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_61F);

    /* DS->ULP(4) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_60B);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_60B);

    /* DS->ULP(5) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_603);
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_603);

    /* DS->ULP(6) */
    /* Change frequency to ULP Frequency */
    /* Revisit this code during B0 */
    /* Cy_SysClk_ClkHfEnableDividerWithMask(clkHfMask, CY_SYSCLK_CLKHF_NO_DIVIDE); */
    Cy_SysClk_ClkHfEnableDirectMuxWithMask(clkHfMask, false);
}

void Cy_SysPm_SetRamTrimsPreDs(void)
{
    while (CY_IPC_SEMA_STATUS_LOCKED == Cy_IPC_Sema_Status(CY_SYSPM_SEMA_NUM_MULTI_CORE)) {}
    (void)Cy_IPC_Sema_Set(CY_SYSPM_SEMA_NUM_MULTI_CORE, false);

#if (CY_CPU_CORTEX_M33)
    if (Cy_SysPm_Cm55IsDeepSleep())
#endif
#if (CY_CPU_CORTEX_M55)
        if (Cy_SysPm_Cm33IsDeepSleep())
#endif
        {
            if (Cy_SysPm_IsSystemHp())
            {
                Cy_SysPm_SystemEnterHpToDs();
            }
            else if (Cy_SysPm_IsSystemLp())
            {
                Cy_SysPm_SystemEnterLpToDs();
            }
            else if (Cy_SysPm_IsSystemUlp())
            {
                Cy_SysPm_SystemEnterUlpToDs();
            }
            else
            {
                /* Do Nothing */
            }
        }

    (void)Cy_IPC_Sema_Clear(CY_SYSPM_SEMA_POST_TRIM_STATUS, false);

    (void)Cy_IPC_Sema_Clear(CY_SYSPM_SEMA_NUM_MULTI_CORE, false);
}

void Cy_SysPm_SetRamTrimsPostDs(void)
{
    while (CY_IPC_SEMA_STATUS_LOCKED == Cy_IPC_Sema_Status(CY_SYSPM_SEMA_NUM_MULTI_CORE)) {}
    (void)Cy_IPC_Sema_Set(CY_SYSPM_SEMA_NUM_MULTI_CORE, false);

    if (CY_IPC_SEMA_STATUS_UNLOCKED == Cy_IPC_Sema_Status(CY_SYSPM_SEMA_POST_TRIM_STATUS)) {}
    {
        if (Cy_SysPm_IsSystemHp())
        {
            Cy_SysPm_SystemEnterDsToHp();
        }
        else if (Cy_SysPm_IsSystemLp())
        {
            Cy_SysPm_SystemEnterDsToLp();
        }
        else if (Cy_SysPm_IsSystemUlp())
        {
            Cy_SysPm_SystemEnterDsToUlp();
        }
        else
        {
            /* Do Nothing */
        }

        (void)Cy_IPC_Sema_Set(CY_SYSPM_SEMA_POST_TRIM_STATUS, false);
    }

    (void)Cy_IPC_Sema_Clear(CY_SYSPM_SEMA_NUM_MULTI_CORE, false);
}

static cy_en_syspm_status_t Cy_SysPm_SystemEnterHpToLp(void)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* HP to LP Sequence */

    /* 1) M33 send IPC to m0seccpuss - Operating mode change target */
    //TBD

    /* 2) Retention Level change */
    //TBD

    /* 3) Reduce the frequency so it is at least ??% (400MHz to <=75MHz) below the static timing closure limits at the new voltage setting for SRAM timing margin */
    /* Frequency Reduction needs to be done before calling this API */


    /* 4) SRAM trim updates - HP->LP(2) through HP->LP(5) */
    /* HP->LP(2) */
    Cy_SysPm_SetTrimRamCtl(0U, RAM_TRIM_VAL_343);
    Cy_SysPm_SetTrimRamCtl(1U, RAM_TRIM_VAL_343);

    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_206);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_206);

    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_20F);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_20F);

    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_3F);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_3F);

    Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_B);

    /* HP->LP(3) */
    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_204);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_204);

    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_20C);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_20C);

    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_2D);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_2D);

    /* HP->LP(4) */
    Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_204);
    Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_204);

    /* HP->LP(5) */
    Cy_SysPm_SetTrimRamCtl(0U, RAM_TRIM_VAL_743);
    Cy_SysPm_SetTrimRamCtl(1U, RAM_TRIM_VAL_743);

    Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_604);
    Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_604);

    Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_22D);
    Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_22D);

    /* 5) Change the voltage */
    Cy_SysPm_CoreBuckSetProfile(CY_SYSPM_CORE_BUCK_PROFILE_LP);

    if (CY_SYSPM_SUCCESS != Cy_SysPm_CoreBuckStatus())
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        Cy_SysPm_SramLdoSetVoltage(CY_SYSPM_SRAMLDO_VOLTAGE_0_80V);
        retVal = Cy_SysPm_SramLdoEnable(true);

        if (CY_SYSPM_SUCCESS != retVal)
        {
            retVal = CY_SYSPM_FAIL;
        }
        else
        {
            /* 6) SRAM trim updates - HP->LP(7) */
            /* HP->LP(7) */
            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_604);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_604);

            /* 7) M33 send IPC to m0seccpuss - Voltage at target level */
            //TBD

