PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_syspm_v4.c
    if (CY_SYSPM_SUCCESS != retVal)
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        /* 5.2 Select the ULP voltage profile */
        Cy_SysPm_CoreBuckSetProfile(CY_SYSPM_CORE_BUCK_PROFILE_ULP);

        if (CY_SYSPM_SUCCESS != Cy_SysPm_CoreBuckStatus())
        {
            retVal = CY_SYSPM_FAIL;
        }
        else
        {
            /* 6) SRAM trim updates - LP->ULP(5) & LP->ULP(7) */
            /* LP->ULP(5) */
            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_606);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_606);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_606);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_606);

            Cy_SysPm_SetTrimRamCtl(6U, RAM_TRIM_VAL_61D);
            Cy_SysPm_SetTrimRamCtl(7U, RAM_TRIM_VAL_61D);

            Cy_SysPm_SetTrimRamCtl(8U, RAM_TRIM_VAL_C);

            /* LP->ULP(6) */
            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_607);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_607);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_607);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_607);

            /* LP->ULP(7) */
            Cy_SysPm_SetTrimRamCtl(2U, RAM_TRIM_VAL_603);
            Cy_SysPm_SetTrimRamCtl(3U, RAM_TRIM_VAL_603);

            Cy_SysPm_SetTrimRamCtl(4U, RAM_TRIM_VAL_603);
            Cy_SysPm_SetTrimRamCtl(5U, RAM_TRIM_VAL_603);

            /* 7) M33 send IPC to m0seccpuss - Voltage at target level */
            //TBD

            /* 8) Change RRAM to ULP mode  */
            /* Moved to callback */

            /* 9) Change Frequency  */
            /* Frequency Change needs to be done after calling this API */

            /* 10) M33 sends IPC to m0seccpuss - Frequency at target level */
            //TBD
        }
    }

    return retVal;
}

cy_en_syspm_status_t Cy_SysPm_SystemEnterHp(void)
{
    uint32_t interruptState;
    uint32_t cbLpRootIdx = (uint32_t) CY_SYSPM_HP;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* Call the registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter
    */
    if (pmCallbackRoot[cbLpRootIdx] != NULL)
    {
        retVal = Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_CHECK_READY);
    }

    /* The system can switch into LP only when
    * all executed registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter return CY_SYSPM_SUCCESS
    */
    if (retVal == CY_SYSPM_SUCCESS)
    {

        /* Call the registered callback functions with the
        * CY_SYSPM_BEFORE_TRANSITION parameter
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if (pmCallbackRoot[cbLpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_BEFORE_TRANSITION);
        }

        if (Cy_SysPm_IsSystemLp())
        {
            (void) Cy_SysPm_SystemEnterLpToHp();
        }
        else if (Cy_SysPm_IsSystemUlp())
        {
            (void) Cy_SysPm_SystemEnterUlpToLp();
            (void) Cy_SysPm_SystemEnterLpToHp();
        }
        else
        {
            /*Block added to avoid MISRA errors */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call the registered callback functions with the
        * CY_SYSPM_AFTER_TRANSITION parameter
        */
        if (pmCallbackRoot[cbLpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_AFTER_TRANSITION);
        }
    }
    else
    {
        /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
        * undo everything done in the callback with the CY_SYSPM_CHECK_READY
        * parameter
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HP, CY_SYSPM_CHECK_FAIL);
        retVal = CY_SYSPM_FAIL;
    }

    return retVal;
}


cy_en_syspm_status_t Cy_SysPm_SystemEnterUlp(void)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    uint32_t cbUlpRootIdx = (uint32_t) CY_SYSPM_ULP;

    /* Call the registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter
    */
    if (pmCallbackRoot[cbUlpRootIdx] != NULL)
    {
        retVal = Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_CHECK_READY);
    }

    /* The system can switch into the ULP only when
    * all executed registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter return CY_SYSPM_SUCCESS
    */
    if (retVal == CY_SYSPM_SUCCESS)
    {
        /* Call the registered callback functions with the
        * CY_SYSPM_BEFORE_TRANSITION parameter
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_BEFORE_TRANSITION);
        }

        if (Cy_SysPm_IsSystemLp())
        {
            (void) Cy_SysPm_SystemEnterLpToUlp();
        }
        else if (Cy_SysPm_IsSystemHp())
        {
            (void) Cy_SysPm_SystemEnterHpToLp();
            (void) Cy_SysPm_SystemEnterLpToUlp();
        }
        else
        {
            /*Block added to avoid MISRA errors */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call the registered callback functions with the
        * CY_SYSPM_AFTER_TRANSITION parameter
        */
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_AFTER_TRANSITION);
        }
    }
    else
    {
        /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
        * undo everything done in the callback with the CY_SYSPM_CHECK_READY
        * parameter
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ULP, CY_SYSPM_CHECK_FAIL);
        retVal = CY_SYSPM_FAIL;
    }

    return retVal;
}


cy_en_syspm_status_t Cy_SysPm_SystemEnterLp(void)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    uint32_t cbUlpRootIdx = (uint32_t) CY_SYSPM_LP;

    /* Call the registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter
    */
    if (pmCallbackRoot[cbUlpRootIdx] != NULL)
    {
        retVal = Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_CHECK_READY);
    }

    /* The system can switch into the ULP only when
    * all executed registered callback functions with the
    * CY_SYSPM_CHECK_READY parameter return CY_SYSPM_SUCCESS
    */
    if (retVal == CY_SYSPM_SUCCESS)
    {
        /* Call the registered callback functions with the
        * CY_SYSPM_BEFORE_TRANSITION parameter
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_BEFORE_TRANSITION);
        }

        if (Cy_SysPm_IsSystemHp())
        {
            (void) Cy_SysPm_SystemEnterHpToLp();
        }
        else if (Cy_SysPm_IsSystemUlp())
        {
            (void) Cy_SysPm_SystemEnterUlpToLp();
        }
        else
        {
            /*Block added to avoid MISRA errors */
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call the registered callback functions with the
        * CY_SYSPM_AFTER_TRANSITION parameter
        */
        if (pmCallbackRoot[cbUlpRootIdx] != NULL)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_AFTER_TRANSITION);
        }
    }
    else
    {
        /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
        * undo everything done in the callback with the CY_SYSPM_CHECK_READY
        * parameter
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_LP, CY_SYSPM_CHECK_FAIL);
        retVal = CY_SYSPM_FAIL;
    }

    return retVal;
}


uint32_t Cy_SysPm_ReadStatus(void)
{
    uint32_t pmStatus = 0UL;

    /* Check whether the device is in ULP/LP/HP mode by reading
    *  the core buck profile:
    *  - 0.7V (nominal) - System ULP mode
    *  - 0.8V (nominal) - System LP mode
    *  - 0.9V (nominal) - System HP mode
    */

    /* Read current active regulator */
    /* Current active regulator is LDO */
    if (Cy_SysPm_CoreBuckGetProfile() == CY_SYSPM_CORE_BUCK_PROFILE_LP)
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_LP;
    }
    else if (Cy_SysPm_CoreBuckGetProfile() == CY_SYSPM_CORE_BUCK_PROFILE_ULP)
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_ULP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_HP;
    }

    /* Check whether CM33 is in the deep sleep mode*/
    if ((0u != _FLD2VAL(MXCM33_CM33_STATUS_SLEEPING, MXCM33_CM33_STATUS)) &&
            (0u != _FLD2VAL(MXCM33_CM33_STATUS_SLEEPDEEP, MXCM33_CM33_STATUS)))
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM33_DEEPSLEEP;
    }
    /* Check whether CM33 is in the sleep mode*/
    else if (0u != _FLD2VAL(MXCM33_CM33_STATUS_SLEEPING, MXCM33_CM33_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM33_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM33_ACTIVE;
    }

    /* Check whether CM55 is in the deep sleep mode*/
    if ((0u != _FLD2VAL(MXCM55_CM55_STATUS_SLEEPING, MXCM55_CM55_STATUS)) &&
            (0u != _FLD2VAL(MXCM55_CM55_STATUS_SLEEPDEEP, MXCM55_CM55_STATUS)))
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM55_DEEPSLEEP;
    }
    /* Check whether CM33 is in the sleep mode*/
    else if (0u != _FLD2VAL(MXCM55_CM55_STATUS_SLEEPING, MXCM55_CM55_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM55_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM55_ACTIVE;
    }

    return pmStatus;
}

bool Cy_SysPm_Cm33IsActive(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM33_ACTIVE) != 0u);
}

bool Cy_SysPm_Cm33IsSleep(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM33_SLEEP) != 0u);
}

bool Cy_SysPm_Cm33IsDeepSleep(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM33_DEEPSLEEP) != 0u);
}

bool Cy_SysPm_Cm55IsActive(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM55_ACTIVE) != 0u);
}

bool Cy_SysPm_Cm55IsSleep(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM55_SLEEP) != 0u);
}

bool Cy_SysPm_Cm55IsDeepSleep(void)
{
    return ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM55_DEEPSLEEP) != 0u);
}


#endif /* CY_IP_MXS22SRSS */
/* [] END OF FILE */
